def H(array, T):  # расчёт энтальпии по формуле на слайде 37 лекции 1
    R = 8.31
    result = 0
    for i in range(5):
        result += (array[i] / (i + 1)) * pow(T, i)
    result += array[5] / T
    return result * R * T


def Cp(array, T):  # расчёт теплоёмкости по формуле на слайде 37 лекции 1
    R = 8.31
    result = 0
    for i in range(5):
        result += array[i] * pow(T, i)
    return result * R


def main():
    # красные: 1000 - 6000 K
    # синие: 200 - 1000 K
    # Метанол Third Milenium стр. 68 pdf
    RED_METHANOL = [200.0, 6000.0, 32.04216, 3.52726795E+00, 1.03178783E-02, -3.62892944E-06, 5.77448016E-10]
    BLUE_METHANOL = [-3.42182632E-14, -2.60028834E+04, 5.16758693E+00, 5.65851051E+00, -1.62983419E-02, 6.91938156E-05,
                     -7.58372926E-08]
    # Оксид углерода Third Milenium стр. 71 pdf
    RED_CO = [200.0, 6000.0, 28.01040, 0.30484859E+01, 0.13517281E-02, -0.48579405E-06, 0.78853644E-10]
    BLUE_CO = [-0.46980746E-14, -0.14266117E+05, 0.60170977E+01, 0.35795335E+01, -0.61035369E-03, 0.10168143E-05,
               0.90700586E-09]
    # Водород Third Milenium стр. 242 pdf
    RED_H2 = [200.0, 6000.0, 2.01588, 0.29328305E+01, 0.82659802E-03, -0.14640057E-06, 0.15409851E-10]
    BLUE_H2 = [-0.68879615E-15, -0.81305582E+03, -0.10243164E+01, 0.23443029E+01, 0.79804248E-02, 0.19477917E-04,
               0.20156967E-07]
    T = 525
    print("Тепловой эффект реакции синтеза метанола:",
          round(H(BLUE_METHANOL, T) - (H(BLUE_CO, T) + H(BLUE_H2, T)), 2))  # продукт - реагнеты
    print("теплоемкость метанола:", round(Cp(BLUE_METHANOL, T), 2))


if __name__ == "__main__":
    main()
